<template>
  <div>
    <h3 class="infinite-mobile-h3">基础用法</h3>
    <el-row>
      <infinite-table :table-data="tableData"> </infinite-table>
    </el-row>
  </div>
</template>
<script>
export default {
  methods: {},
  data () {
    return {
      tableData: {
        data: [
          {
            query: {
              jumpCode: null,
              jumpValue: null
            },
            key: '0000-0000-0000-0000',
            '2585-2314-2501-0000': '卓越系列',
            '2585-2314-2501-0001': '0.01',
            '2585-2314-2501-0002': '0.02',
            '2585-2314-2501-0003': '0.03',
            children: [
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '0.11',
                '2585-2314-2501-0002': '0.12',
                '2585-2314-2501-0003': '0.13',
                pKey: '0000-0000-0000-0000',
                key: '0000-0001-0000-0000'
              },
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '0.11',
                '2585-2314-2501-0002': '0.12',
                '2585-2314-2501-0003': '0.13',
                pKey: '0000-0000-0000-0000',
                key: '0000-0002-0000-0000'
              }
            ]
          },
          {
            query: {
              jumpCode: null,
              jumpValue: null
            },
            key: '0001-0000-0000-0000',
            '2585-2314-2501-0000': '稳健系列',
            '2585-2314-2501-0001': '1.01',
            '2585-2314-2501-0002': '1.02',
            '2585-2314-2501-0003': '1.03',
            children: [
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '1.11',
                '2585-2314-2501-0002': '1.12',
                '2585-2314-2501-0003': '1.13',
                pKey: '0001-0000-0000-0000',
                key: '0001-0001-0000-0000'
              },
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '1.11',
                '2585-2314-2501-0002': '1.12',
                '2585-2314-2501-0003': '1.13',
                pKey: '0001-0000-0000-0000',
                key: '0001-0002-0000-0000'
              }
            ]
          }
        ],
        columns: [
          {
            fixed: true,
            isSort: false,
            key: '2585-2314-2501-0000',
            name: '产品名称',
            sort: '0',
            style: {},
            unit: ''
          },
          {
            fixed: false,
            isSort: true,
            key: '2585-2314-2501-0001',
            name: '当年收入',
            sort: '1',
            style: {},
            unit: '亿'
          },
          {
            fixed: false,
            isSort: true,
            key: '2585-2314-2501-0002',
            name: '当月收入',
            sort: '0',
            style: {},
            unit: '亿'
          },
          {
            fixed: false,
            isSort: true,
            key: '2585-2314-2501-0003',
            name: '当日收入',
            sort: '0',
            style: {},
            unit: '亿'
          }
        ]
      }
    }
  }
}
</script>

<style scopt>
  .infinite-mobile-h3 {
    margin: 4.267vw 0 0 12px;
  }
</style>
