<template>
  <div>
    <el-row class="infinite-doc-demo-block-row">
      <h2 class="infinite-doc-demo-block-title">基础用法</h2>
      <div class="infinite-doc-demo-block-table ">
        <!-- <infinite-table :table-data="tableData"> </infinite-table> -->
        <infinite-table :rank-data-obj="rankDataObj"> </infinite-table>
      </div>
    </el-row>
  </div>
</template>
<script>
export default {
  methods: {},
  data () {
    return {
      tableData: {
        data: [
          {
            query: {
              jumpCode: null,
              jumpValue: null
            },
            key: '0000-0000-0000-0000',
            '2585-2314-2501-0000': '卓越系列',
            '2585-2314-2501-0001': '0.01',
            '2585-2314-2501-0002': '0.02',
            '2585-2314-2501-0003': '0.03',
            children: [
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '0.11',
                '2585-2314-2501-0002': '0.12',
                '2585-2314-2501-0003': '0.13',
                pKey: '0000-0000-0000-0000',
                key: '0000-0001-0000-0000'
              },
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '0.11',
                '2585-2314-2501-0002': '0.12',
                '2585-2314-2501-0003': '0.13',
                pKey: '0000-0000-0000-0000',
                key: '0000-0002-0000-0000'
              }
            ]
          },
          {
            query: {
              jumpCode: null,
              jumpValue: null
            },
            key: '0001-0000-0000-0000',
            '2585-2314-2501-0000': '稳健系列',
            '2585-2314-2501-0001': '1.01',
            '2585-2314-2501-0002': '1.02',
            '2585-2314-2501-0003': '1.03',
            children: [
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '1.11',
                '2585-2314-2501-0002': '1.12',
                '2585-2314-2501-0003': '1.13',
                pKey: '0001-0000-0000-0000',
                key: '0001-0001-0000-0000'
              },
              {
                '2585-2314-2501-0000': '卓越一级1号',
                '2585-2314-2501-0001': '1.11',
                '2585-2314-2501-0002': '1.12',
                '2585-2314-2501-0003': '1.13',
                pKey: '0001-0000-0000-0000',
                key: '0001-0002-0000-0000'
              }
            ]
          }
        ],
        columns: [
          {
            fixed: true,
            isSort: false,
            key: '2585-2314-2501-0000',
            name: '产品名称',
            sort: '0',
            style: {},
            unit: ''
          },
          {
            fixed: false,
            isSort: true,
            key: '2585-2314-2501-0001',
            name: '当年收入',
            sort: '1',
            style: {},
            unit: '亿'
          },
          {
            fixed: false,
            isSort: true,
            key: '2585-2314-2501-0002',
            name: '当月收入',
            sort: '0',
            style: {},
            unit: '亿'
          },
          {
            fixed: false,
            isSort: true,
            key: '2585-2314-2501-0003',
            name: '当日收入',
            sort: '0',
            style: {},
            unit: '亿'
          }
        ]
      },
      rankDataObj: {
        headers: ['产品名称', '当年收入(亿)', '当月收入(亿)', '当日收入(亿)'],
        rows: [
          {
            rowValue: ['卓越系列', '0.11', '0.07', '0.11'],
            rows: [
              {
                rowValue: ['卓越一年1号', '0.03', '0.01', '0.03'],
                rows: []
              },
              {
                rowValue: ['卓越一年3号', '0.01', '0.00', '0.01'],
                rows: []
              },
              {
                rowValue: ['卓越一年2号', '0.01', '0.01', '0.01'],
                rows: []
              }
            ]
          },
          {
            rowValue: ['现金类', '4.62', '1.93', '4.62'],
            rows: [
              {
                rowValue: ['天天成长C', '1.69', '0.66', '1.69'],
                rows: []
              },
              {
                rowValue: ['天天成长A', '1.45', '0.59', '1.45'],
                rows: []
              },
              {
                rowValue: ['天天成长B', '0.85', '0.33', '0.85'],
                rows: []
              }
            ]
          },
          {
            rowValue: ['启航系列', '0.66', '0.33', '0.66'],
            rows: [
              {
                rowValue: ['启航半年1号', '0.11', '0.05', '0.11'],
                rows: []
              },
              {
                rowValue: ['启航一年5号', '0.06', '0.02', '0.06'],
                rows: []
              },
              {
                rowValue: ['启航半年4号', '0.03', '0.02', '0.03'],
                rows: []
              }
            ]
          }
        ]
      }
    }
  }
}
</script>
